### Task 1: Import Pandas and observe the structure of the file "yob2021.txt"

In [1]:
import pandas as pd

### Task 2: Read the file "yob2021.txt" into pandas

In [21]:
df = pd.read_csv("yob2021.txt", sep=",", header=None, names=["Name", "Gender", "Frequency"])

### Task 3: Print the first 10 rows

df.head(10)

### Task 4: Display the number of rows and columns

In [9]:
df.shape

(31728, 3)

### Task 5: Calculate the total numbers of babies born in 2021

In [27]:
df["Frequency"].sum()

3384687

### Task 6: Calculate the sum for boys and girls separately

In [88]:
(df["Gender"] == "M").sum()

14080

In [90]:
(df["Gender"] == "F").sum()

17649

### Task 7: Check if your name occurs in the data.

In [49]:
"Bastian" in df.values

True

### Task 8: Calculate the percentage of girls and boys among the total births.

In [67]:
(df["Gender"] == "M").sum() / df["Gender"].count()

0.44375807620788554

In [69]:
(df["Gender"] == "F").sum() / df["Gender"].count()

0.5562419237921145

### Task 9: Create a table that contains the top 5 girls names and top 5 boys names.

In [139]:
boys_top = df[(df["Gender"] == "M")].head(5)

In [141]:
girls_top = df[(df["Gender"] == "F")].head(5)

In [143]:
top_names = pd.concat([boys_top, girls_top])

In [145]:
top_names

            Name Gender  Frequency
17649       Liam      M      20391
17650       Noah      M      18884
17651     Oliver      M      14696
17652     Elijah      M      12807
17653      James      M      12452
0         Olivia      F      17824
1           Emma      F      15530
2      Charlotte      F      13352
3         Amelia      F      13024
4            Ava      F      12854

### Task 10: Write the data from task 9 to an Excel Spreadsheet

In [157]:
top_names.to_excel("top_baby_names.xlsx")